[
  {
    "id": "1",
    "title": "From Village School to Engineering College",
    "excerpt": "Ravi's journey from a small village in Rajasthan to becoming a software engineer at a Fortune 500 company.",
    "content": "Ravi grew up in a small village in Rajasthan where his father worked as a farmer. Despite financial constraints, his family prioritized education. When Ravi excelled in his 12th grade exams, the dream of engineering college seemed impossible due to the high fees. PerhitSiksha stepped in, providing not just financial support but also mentorship throughout his journey. Today, Ravi works as a software engineer and has started a coding club in his village to inspire other young minds.",
    "category": "Education",
    "date": "2024-03-15",
    "image": "/images/stories/ravi-story.jpg",
    "featured": true
  },
  {
    "id": "2",
    "title": "Breaking the Glass Ceiling",
    "excerpt": "How Sneha became the first woman in her family to pursue higher education and is now a successful doctor.",
    "content": "In a conservative family where women were traditionally not encouraged to pursue careers, Sneha's determination to become a doctor seemed like an impossible dream. With PerhitSiksha's support, she not only completed her medical degree but also specialized in pediatrics. She now runs a free clinic in her hometown, providing healthcare to underprivileged children and inspiring other young women in her community.",
    "category": "Career",
    "date": "2024-02-28",
    "image": "/images/stories/sneha-story.jpg",
    "featured": true
  },
  {
    "id": "3",
    "title": "Building Tomorrow's Leaders",
    "excerpt": "The story of how our mentorship program shapes not just careers, but character.",
    "content": "Our mentorship program pairs students with industry professionals who provide guidance beyond academics. The story of Maya and her mentor Dr. Krishnan shows how this relationship transformed not just Maya's career prospects but also her confidence and leadership skills. Maya, who was once shy and uncertain, now leads a student organization and has already started her own social initiative.",
    "category": "Community",
    "date": "2024-01-20",
    "featured": false
  },
  {
    "id": "4",
    "title": "The Ripple Effect of Education",
    "excerpt": "How supporting one student's education created positive change in an entire community.",
    "content": "When we supported Arjun's engineering education, we didn't just help one student. Arjun went on to develop water purification systems for rural areas. His innovation has now provided clean water to over 50 villages, impacting thousands of lives. This is the ripple effect of education - one supported student can transform entire communities.",
    "category": "Community",
    "date": "2023-12-10",
    "image": "/images/stories/arjun-story.jpg",
    "featured": true
  },
  {
    "id": "5",
    "title": "Second Chances, First Success",
    "excerpt": "Mohan's story of overcoming early academic setbacks to achieve his dreams.",
    "content": "Mohan failed his first attempt at engineering entrance exams and spent two years working odd jobs to support his family. When he decided to try again, PerhitSiksha provided support for coaching classes and living expenses. Not only did he clear the exams, but he also graduated with honors and now works in renewable energy, contributing to India's clean energy mission.",
    "category": "Education",
    "date": "2023-11-22",
    "featured": false
  },
  {
    "id": "6",
    "title": "Beyond Boundaries",
    "excerpt": "How technology is helping us reach students in the most remote areas of India.",
    "content": "In the remote hills of Uttarakhand, internet connectivity was a luxury. But when Priya, a bright student, couldn't afford to move to the city for coaching classes, we leveraged technology to bring education to her. Through virtual mentoring and online resources, Priya not only cleared her medical entrance exams but also topped her district. Her success has inspired other students in remote areas to dream big.",
    "category": "Education",
    "date": "2023-10-15",
    "image": "/images/stories/priya-remote.jpg",
    "featured": false
  },
  {
    "id": "7",
    "title": "A Father's Dream Realized",
    "excerpt": "Amit Kashyap shares how PerhitSiksha helped fulfill his dreams for his child's education.",
    "content": "As a parent, Amit Kashyap had big dreams for his child's education but faced financial constraints. PerhitSiksha's support not only provided the necessary funding but also guidance that helped his family navigate the educational journey. Today, his story inspires other parents who believe in the power of education to transform lives.",
    "category": "Family",
    "date": "2024-04-10",
    "youtubeId": "6DVA-T63h8g",
    "featured": true
  },
  {
    "id": "8",
    "title": "A Mother's Journey",
    "excerpt": "Golagani Laxmi's inspiring story of supporting her child's educational dreams.",
    "content": "Golagani Laxmi's determination to provide quality education for her child led her to PerhitSiksha. Her story represents countless parents who sacrifice and strive to give their children better opportunities. Through PerhitSiksha's support, her dreams became reality.",
    "category": "Family",
    "date": "2024-04-05",
    "youtubeId": "QX7gPeQx12g",
    "featured": false
  },
  {
    "id": "9",
    "title": "Mentoring the Future",
    "excerpt": "Abhishek Raj shares his experience as a mentor with PerhitSiksha.",
    "content": "Abhishek Raj's journey as a mentor with PerhitSiksha showcases the transformative power of guidance and support. His dedication to helping students achieve their goals demonstrates how mentorship can change lives and create lasting impact in communities.",
    "category": "Mentorship",
    "date": "2024-03-28",
    "youtubeId": "xNaremGF8Ko",
    "featured": true
  },
  {
    "id": "10",
    "title": "Guiding with Purpose",
    "excerpt": "Prashant Mishra's story of becoming a mentor and making a difference.",
    "content": "Prashant Mishra's commitment to mentoring through PerhitSiksha reflects the organization's core values of guidance and support. His experience shows how professionals can give back to society by helping shape the next generation of leaders and innovators.",
    "category": "Mentorship",
    "date": "2024-03-20",
    "youtubeId": "gDyZVALHhxU",
    "featured": false
  }
]