[
  {
    "id": "1",
    "name": "Ayushi",
    "role": "Student",
    "location": "India",
    "youtubeId": "-nO2AIZNbbY",
    "quote": "Perhitsiksha provided me with the support I needed to pursue my education. Their mentorship and guidance helped me achieve my goals.",
    "featured": true
  },
  {
    "id": "2",
    "name": "Kodamanchili Keerthi",
    "role": "Student",
    "location": "India",
    "youtubeId": "SLSTiVsaw9o",
    "quote": "Through Perhitsiksha, I was able to overcome financial barriers and focus on my studies. The support made all the difference in my educational journey.",
    "featured": false
  },
  {
    "id": "3",
    "name": "Kumari Astha",
    "role": "Student",
    "location": "India",
    "youtubeId": "6EiYyVOujX8",
    "quote": "Perhitsiksha gave me the opportunity to pursue higher education when my family couldn't afford it. I'm grateful for their belief in my potential.",
    "featured": true
  },
  {
    "id": "4",
    "name": "Uma Mahesh",
    "role": "Contributor",
    "location": "India",
    "youtubeId": "ffztznX6NI8",
    "quote": "Contributing to Perhitsiksha gives me immense satisfaction knowing that my support directly impacts a student's future. It's the most meaningful investment I make.",
    "featured": false
  },
  {
    "id": "5",
    "name": "Jitendra Patel",
    "role": "Coordinator",
    "location": "India",
    "youtubeId": "Z37rsfqWu6E",
    "quote": "Working with Perhitsiksha has shown me the transformative power of education. Every day, I witness students breaking barriers and achieving their dreams.",
    "featured": true
  },
  {
    "id": "6",
    "name": "Amit Kashyap",
    "role": "Parent",
    "location": "India",
    "youtubeId": "6DVA-T63h8g",
    "quote": "Perhitsiksha's support not only provided the necessary funding but also guidance that helped our family navigate the educational journey. Today, our story inspires other parents who believe in the power of education.",
    "featured": true
  },
  {
    "id": "7",
    "name": "Golagani Laxmi",
    "role": "Parent",
    "location": "India",
    "youtubeId": "QX7gPeQx12g",
    "quote": "My determination to provide quality education for my child led me to Perhitsiksha. They helped make our dreams a reality and gave my child better opportunities.",
    "featured": false
  },
  {
    "id": "8",
    "name": "Abhishek Raj",
    "role": "Mentor",
    "location": "India",
    "youtubeId": "xNaremGF8Ko",
    "quote": "My journey as a mentor with Perhitsiksha showcases the transformative power of guidance and support. Helping students achieve their goals demonstrates how mentorship can change lives.",
    "featured": true
  },
  {
    "id": "9",
    "name": "Prashant Mishra",
    "role": "Mentor",
    "location": "India",
    "youtubeId": "gDyZVALHhxU",
    "quote": "My commitment to mentoring through Perhitsiksha reflects the organization's core values of guidance and support. I help shape the next generation of leaders and innovators.",
    "featured": false
  },
  {
    "id": "10",
    "name": "K Madhuri",
    "role": "Parent",
    "location": "India",
    "youtubeId": "VGxDPY10k4E",
    "quote": "Perhitsiksha's support has been instrumental in my child's educational journey. Their commitment to helping families like ours is truly remarkable.",
    "featured": false
  },
  {
    "id": "11",
    "name": "Uma Shankar",
    "role": "Parent",
    "location": "India",
    "youtubeId": "86HzMPnEe7c",
    "quote": "Through Perhitsiksha, my child received the educational opportunities I always dreamed of providing. Their support changed our family's future.",
    "featured": false
  },
  {
    "id": "12",
    "name": "Sunita Gupta",
    "role": "Parent",
    "location": "India",
    "youtubeId": "S0zH15KHTRE",
    "quote": "Perhitsiksha's assistance gave my child the chance to pursue higher education. I'm grateful for their belief in our children's potential.",
    "featured": true
  },
  {
    "id": "13",
    "name": "Prem Kumar",
    "role": "Parent",
    "location": "India",
    "youtubeId": "uDgrpL_I-HY",
    "quote": "The support from Perhitsiksha has been life-changing for our family. Education is the key to breaking barriers, and they made it possible.",
    "featured": false
  },
  {
    "id": "14",
    "name": "Rajsree Rawat",
    "role": "Parent",
    "location": "India",
    "youtubeId": "UtKlUTgUhs0",
    "quote": "Perhitsiksha's dedication to helping families overcome educational challenges is inspiring. They truly understand the value of every child's dreams.",
    "featured": true
  }
]
